Documents/ПродажаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаОстатках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаОстатках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаОстатках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПродажаТовара/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыВРезерве.Записывать = Истина;
	Движения.ТоварыНаОстатках.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыВРезерве");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаОстатках");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовара.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТовара.Количество) КАК Количество,
		|	ПродажаТовара.Ссылка.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ втТекущийПродажа
		|ИЗ
		|	Документ.ПродажаТовара.Товары КАК ПродажаТовара
		|ГДЕ
		|	ПродажаТовара.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовара.Номенклатура,
		|	ПродажаТовара.Ссылка.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаОстаткахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаОстаткахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ втОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыНаОстатках.Остатки(
		|			&Дата,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					втТекРезерв.Номенклатура
		|				ИЗ
		|					втТекущийПродажа КАК втТекРезерв)) КАК ТоварыНаОстаткахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеОстатки.ВРезервеОстаток КАК ВРезервеОстаток,
		|	ТоварыВРезервеОстатки.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ втРезервКонтрагента
		|ИЗ
		|	РегистрНакопления.ТоварыВРезерве.Остатки(
		|			&Дата,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						втТекРезерв.Номенклатура
		|					ИЗ
		|						втТекущийПродажа КАК втТекРезерв)
		|				И Контрагент = &Контрагент) КАК ТоварыВРезервеОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеОстатки.ВРезервеОстаток КАК ВРезервеОстаток
		|ПОМЕСТИТЬ втРезервОбщий
		|ИЗ
		|	РегистрНакопления.ТоварыВРезерве.Остатки(
		|			&Дата,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					втТекРезерв.Номенклатура
		|				ИЗ
		|					втТекущийПродажа КАК втТекРезерв)) КАК ТоварыВРезервеОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТекущийПродажа.Номенклатура КАК Номенклатура,
		|	втТекущийПродажа.Количество КАК Количество,
		|	ЕСТЬNULL(втРезервОбщий.ВРезервеОстаток, 0) КАК ВРезервеОстатокОбщий,
		|	ЕСТЬNULL(втРезервКонтрагента.ВРезервеОстаток, 0) КАК ВРезервеОстатокКонтрагента,
		|	ЕСТЬNULL(втОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ИЗ
		|	втТекущийПродажа КАК втТекущийПродажа
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
		|		ПО втТекущийПродажа.Номенклатура = втОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезервОбщий КАК втРезервОбщий
		|		ПО втТекущийПродажа.Номенклатура = втРезервОбщий.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРезервКонтрагента КАК втРезервКонтрагента
		|		ПО втТекущийПродажа.Номенклатура = втРезервКонтрагента.Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ОстатокПослеПродажи = Выборка.КоличествоОстаток + Выборка.ВРезервеОстатокКонтрагента 
												- Выборка.Количество - Выборка.ВРезервеОстатокОбщий;
		Если ОстатокПослеПродажи < 0 Тогда
		
			Сообщение = СтрШаблон("Не хватает товара %1 для продажи в количестве %2", 
											Выборка.Номенклатура, -ОстатокПослеПродажи);
			Сообщить(Сообщение);
			Отказ = Истина;
			Продолжить;
		КонецЕсли; 
		
		Если Выборка.ВРезервеОстатокКонтрагента > 0 Тогда
			
			КоличествоРезерв = Мин(Выборка.ВРезервеОстатокКонтрагента, Выборка.Количество);
			
			Движение = Движения.ТоварыВРезерве.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.ВРезерве = КоличествоРезерв;
			
		КонецЕсли; 
		
		Движение = Движения.ТоварыНаОстатках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		
	КонецЦикла; 

КонецПроцедуры
